Fillet may cause the supports unjoin with the rail.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MayUnjoinRailAndSupports { get; }
  Visual Basic
Public Shared ReadOnly Property MayUnjoinRailAndSupports As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MayUnjoinRailAndSupports {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace